# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 2  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [8,5, 6,8, 8,10]
  - [11,17, 12,17, 14,16]
  - [13,21, 18,16, 21,24]
  - [33,24, 29,31, 31,30]
  - [37,37, 41,38, 42,43]
  - [41,66, 64,52, 77,55]
  - [58,76, 77,62, 55,88]
  - [66,75, 72,70, 86,61]
  - [52,115, 98,79, 71,116]
  - [100,89, 66,157, 81,152]
  - [100,127, 158,86, 114,130]
  - [117,141, 99,172, 155,120]
  - [126,162, 132,156, 128,164]
  - [147,143, 180,124, 174,129]
  - [243,99, 171,149, 164,157]
  - [131,206, 148,192, 159,179]
  - [182,156, 161,177, 182,160]
  - [162,179, 162,183, 174,172]
  - [161,208, 150,267, 257,157]
  - [185,238, 244,190, 252,188]
  - [218,219, 245,197, 267,199]
  - [267,199, 222,259, 264,224]
  - [227,281, 288,239, 311,229]
  - [192,391, 245,336, 218,381]
  - [335,248, 345,242, 329,255]
  - [258,355, 319,293, 256,374]
  - [315,313, 366,269, 412,240]
  - [360,276, 334,305, 212,502]
  - [287,373, 267,409, 311,356]
  - [444,268, 525,228, 292,431]
  - [433,294, 394,327, 330,393]
  - [252,562, 427,336, 393,376]
  - [412,370, 370,413, 515,301]
  - [556,283, 343,459, 322,495]
  - [381,426, 538,315, 303,564]
  - [476,368, 435,410, 367,487]
  - [257,700, 440,421, 552,343]
  - [362,528, 494,395, 530,385]
  - [437,481, 608,349, 489,439]
  - [412,544, 438,521, 528,440]
  - [490,481, 397,629, 392,670]
  - [499,530, 659,405, 603,454]
  - [638,430, 400,695, 491,570]
  - [393,728, 569,506, 584,494]
  - [545,555, 514,597, 505,608]
  - [553,561, 547,572, 546,600]
  - [553,593, 720,456, 481,684]
  - [437,757, 494,669, 705,532]
  - [640,625, 643,647, 595,740]
  - [693,678, 638,981, 719,930]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
